-- phpMyAdmin SQL Dump
-- version 3.4.10.1deb1
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2014 年 04 月 04 日 22:50
-- 服务器版本: 5.5.35
-- PHP 版本: 5.3.10-1ubuntu3.10

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `4_smart0eddie`
--

-- --------------------------------------------------------

--
-- 表的结构 `activity`
--

CREATE TABLE IF NOT EXISTS `activity` (
  `user_id` varchar(30) CHARACTER SET utf8 NOT NULL,
  `movement_id` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- 表的结构 `discuss`
--

CREATE TABLE IF NOT EXISTS `discuss` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `topicID` int(11) NOT NULL,
  `topicName` varchar(255) NOT NULL,
  `userID` varchar(255) NOT NULL,
  `userName` varchar(255) NOT NULL,
  `comment` text NOT NULL,
  `like` int(11) NOT NULL,
  `dislike` int(11) NOT NULL,
  `upTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=122 ;

--
-- 转存表中的数据 `discuss`
--

INSERT INTO `discuss` (`id`, `topicID`, `topicName`, `userID`, `userName`, `comment`, `like`, `dislike`, `upTime`) VALUES
(66, 7, '沒電怎生活？', '101', 'demo', '用毯毯把自己蓋起來!\n', 0, 0, '2013-06-05 08:32:54'),
(67, 67, '如果不用核能，未來的用電量該何去何從?', '101', 'demo', '我認為這需要全台灣的公民進行投票表決才能夠決定...', 0, 0, '2013-06-05 08:39:56'),
(102, 67, '如果不用核能，未來的用電量該何去何從?', '105', 'Sham', '說實在的，如果人不珍惜電力的話，那總有一天會少電...核能只是一個例子，你說風力發電不會造成汙染嗎?你說太陽能板不需要製造嗎?這是雞生蛋蛋生雞的問題...', 0, 0, '2013-06-08 09:55:32'),
(101, 67, '如果不用核能，未來的用電量該何去何從?', '132', '鄧維岱', '多省電是最好的辦法XD', 0, 0, '2013-06-07 13:26:40'),
(72, 67, '如果不用核能，未來的用電量該何去何從?', '150', 'Chi-En Chang', '既然上線了，上面的那些測試用的留言是不是該刪掉了阿？', 0, 0, '2013-06-07 07:58:16'),
(73, 6, '核四公投案議事又空轉', '97', 'Hsu Yuan-Ling', '在空轉叫立委把錢吐出來！', 1, 0, '2013-06-07 14:39:39'),
(103, 67, '如果不用核能，未來的用電量該何去何從?', '160', 'Gary Lai', 'Great Website', 0, 0, '2013-06-21 16:36:57'),
(104, 67, '如果不用核能，未來的用電量該何去何從?', '105', 'Sham', '一定要好好省電!', 0, 0, '2013-06-23 08:33:22'),
(105, 68, '大家一起來決定台灣的未來!', '105', 'Sham', '對於核能一定要想出一個好的解決辦法!', 0, 0, '2013-06-23 08:33:50'),
(106, 68, '大家一起來決定台灣的未來!', '105', 'Sham', '大家!!趕快來共同討論吧!', 0, 0, '2013-06-24 12:51:46'),
(107, 69, '大家一起來討論風力發電的可能!', '105', 'Sham', '我覺得風力發電對於台灣很適合阿!', 1, 0, '2013-06-24 12:52:15'),
(112, 69, '大家一起來討論風力發電的可能!', '173', 'Larry Lai', '可是風力發電會對生態造成一定的危害耶...\n台灣的鳥類要哭哭了QQ', 1, 0, '2013-07-04 13:36:47'),
(109, 69, '大家一起來討論風力發電的可能!', '105', 'Sham', '所以太陽能會比較好嗎', 0, 0, '2013-06-24 16:41:18'),
(110, 7, '沒電怎生活？', '105', 'Sham', '那就用...火維生', 0, 0, '2013-06-24 17:03:03'),
(111, 8, '再生能源成本恐帶動高電價', '105', 'Sham', '那似乎需要看是哪一種能源，不可以偏概全', 0, 0, '2013-06-25 14:51:07'),
(114, 70, 'tetstesttest', '174', 'Kevin D Chang', 'tetetstetestestestset', 0, 1, '2013-07-24 09:23:16'),
(113, 70, 'tetstesttest', '174', 'Kevin D Chang', 'testtestest', 0, 1, '2013-07-24 09:22:59'),
(115, 70, 'tetstesttest', '178', 'Chi-En Chang', '如果這個網站有要真的推上線的話，有兩個建議\n1. 搜尋引擎最佳化，可以參考http://www.raidenhttpd.com/manual/seo.html\n不然現在其實不論搜尋「群眾運動」還是「Movement」，都沒辦法找到這個網站\n2. 網頁loading速度慢到難以接受\n\n看到你們參加ideas show，感覺你們是認真的要把他上線，很厲害，加油！！', 2, 0, '2013-07-25 16:53:19'),
(116, 70, 'tetstesttest', '178', 'Chi-En Chang', '打Movement反而找到這個http://themovement.dk/和這個http://www.movements.org/', 0, 1, '2013-07-25 17:00:58'),
(117, 6, '核四公投案議事又空轉', '181', 'TwMaster Anson', 'tst2434235', 0, 0, '2013-08-21 16:03:55'),
(118, 70, 'tetstesttest', '133', 'Jui Cheng Lai', 'Chi-En Chang\n謝謝您的建議，我們現在將會「開放原始碼」，尋求有興趣的人繼續幫我們的網站建構下去＝）', 0, 1, '2013-08-21 16:07:55'),
(119, 6, '核四公投案議事又空轉', '159', '彭彥綸', 'ttttt', 0, 0, '2013-09-29 10:24:52'),
(120, 70, 'tetstesttest', '132', 'WEI-DAI DENG', '2/26 test', 0, 0, '2014-02-26 07:21:57'),
(121, 70, 'tetstesttest', '132', '鄧維岱', 'dghsh', 0, 0, '2014-02-28 04:09:46');

-- --------------------------------------------------------

--
-- 表的结构 `discuss_topic`
--

CREATE TABLE IF NOT EXISTS `discuss_topic` (
  `category` int(11) NOT NULL,
  `tag` varchar(255) NOT NULL,
  `discuss_topic_id` int(11) NOT NULL AUTO_INCREMENT,
  `discuss_topic_name` varchar(255) NOT NULL,
  `userID` varchar(255) NOT NULL,
  `uptime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  KEY `discuss_topic_id` (`discuss_topic_id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=71 ;

--
-- 转存表中的数据 `discuss_topic`
--

INSERT INTO `discuss_topic` (`category`, `tag`, `discuss_topic_id`, `discuss_topic_name`, `userID`, `uptime`) VALUES
(2, '', 1, '低碳VS.非核家園核四議題攻防', 'demo', '2013-05-24 13:12:04'),
(2, '', 2, '綠能取代核能！？', 'demo', '2013-05-24 13:13:14'),
(2, '', 4, '核四議題與營運狀況', 'demo', '2013-05-24 13:14:13'),
(2, '', 5, '擁核ＶＳ.反核？「核四論壇」', 'demo', '2013-05-24 13:14:28'),
(2, '', 6, '核四公投案議事又空轉', 'demo', '2013-05-24 13:14:42'),
(2, '', 7, '沒電怎生活？', 'demo', '2013-05-24 13:14:55'),
(2, '', 8, '再生能源成本恐帶動高電價', 'demo', '2013-05-24 13:15:10'),
(2, '', 69, '大家一起來討論風力發電的可能!', '105', '2013-06-24 12:52:15'),
(2, '', 70, 'tetstesttest', '174', '2013-07-24 09:22:59'),
(2, '', 68, '大家一起來決定台灣的未來!', '105', '2013-06-23 08:33:50'),
(2, '', 67, '如果不用核能，未來的用電量該何去何從?', '101', '2013-06-05 08:39:56');

-- --------------------------------------------------------

--
-- 表的结构 `join_list`
--

CREATE TABLE IF NOT EXISTS `join_list` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `topicID` int(11) NOT NULL,
  `userNO` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=latin1 AUTO_INCREMENT=47 ;

--
-- 转存表中的数据 `join_list`
--

INSERT INTO `join_list` (`id`, `topicID`, `userNO`) VALUES
(27, 230, 97),
(26, 229, 97),
(25, 244, 97),
(24, 236, 97),
(23, 230, 121),
(22, 229, 121),
(21, 236, 121),
(20, 244, 104),
(19, 229, 104),
(18, 230, 104),
(28, 236, 104),
(29, 233, 104),
(30, 232, 101),
(31, 245, 133),
(32, 264, 121),
(33, 267, 97),
(34, 244, 121),
(35, 233, 121),
(36, 264, 134),
(37, 245, 105),
(38, 244, 105),
(39, 264, 105),
(40, 229, 105),
(41, 228, 163),
(42, 234, 150),
(43, 264, 107),
(44, 276, 133),
(45, 281, 101),
(46, 245, 101);

-- --------------------------------------------------------

--
-- 表的结构 `likedb`
--

CREATE TABLE IF NOT EXISTS `likedb` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `liked` tinyint(4) DEFAULT NULL,
  `disliked` tinyint(4) DEFAULT NULL,
  `DorM` tinyint(4) DEFAULT NULL,
  `commentid` int(11) DEFAULT NULL,
  `username` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=53 ;

--
-- 转存表中的数据 `likedb`
--

INSERT INTO `likedb` (`id`, `liked`, `disliked`, `DorM`, `commentid`, `username`) VALUES
(40, 1, 0, 0, 116, '133'),
(39, 1, 0, 0, 115, '146'),
(38, 1, 0, 0, 113, '146'),
(37, 1, 0, 0, 112, '146'),
(36, 1, 0, 0, 110, '146'),
(35, 1, 0, 0, 109, '146'),
(34, 1, 0, 0, 108, '146'),
(33, 1, 0, 0, 99, '146'),
(32, 1, 0, 0, 100, '146'),
(31, 1, 0, 0, 101, '146'),
(30, 1, 0, 0, 103, '146'),
(29, 1, 0, 0, 104, '146'),
(28, 1, 0, 1, 112, '146'),
(41, 1, 0, 0, 100, '132'),
(42, 1, 0, 1, 107, '146'),
(43, 1, 0, 0, 115, '121'),
(44, 1, 0, 0, 104, '178'),
(45, 1, 0, 1, 115, '179'),
(46, 1, 0, 1, 73, '181'),
(47, 1, 0, 1, 115, '133'),
(48, 1, 0, 0, 116, '184'),
(49, 0, 1, 1, 113, '159'),
(50, 0, 1, 1, 114, '159'),
(51, 0, 1, 1, 116, '159'),
(52, 0, 1, 1, 118, '159');

-- --------------------------------------------------------

--
-- 表的结构 `mem_db`
--

CREATE TABLE IF NOT EXISTS `mem_db` (
  `No` int(11) NOT NULL AUTO_INCREMENT,
  `id` varchar(30) NOT NULL,
  `pw` varchar(40) NOT NULL,
  `username` varchar(30) NOT NULL,
  `username_public` int(1) NOT NULL DEFAULT '1',
  `nickname` varchar(30) NOT NULL,
  `email` varchar(50) NOT NULL,
  `email_public` int(1) NOT NULL DEFAULT '1',
  `gender` varchar(1) NOT NULL,
  `gender_public` int(1) NOT NULL DEFAULT '1',
  `birth` date NOT NULL,
  `birth_public` int(1) NOT NULL DEFAULT '1',
  `address` varchar(100) NOT NULL,
  `address_public` int(1) NOT NULL DEFAULT '1',
  `photo` text NOT NULL,
  `class` int(2) NOT NULL DEFAULT '1',
  `FB_id` varchar(50) NOT NULL,
  `Google_id` varchar(50) NOT NULL,
  `Twitter_id` varchar(50) NOT NULL,
  `times` int(5) NOT NULL DEFAULT '0',
  `register_time` datetime NOT NULL,
  `last_login_time` datetime NOT NULL,
  `verify` int(1) NOT NULL DEFAULT '0',
  `finalstr` text NOT NULL,
  `ip` varchar(30) NOT NULL,
  PRIMARY KEY (`No`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=192 ;

--
-- 转存表中的数据 `mem_db`
--

INSERT INTO `mem_db` (`No`, `id`, `pw`, `username`, `username_public`, `nickname`, `email`, `email_public`, `gender`, `gender_public`, `birth`, `birth_public`, `address`, `address_public`, `photo`, `class`, `FB_id`, `Google_id`, `Twitter_id`, `times`, `register_time`, `last_login_time`, `verify`, `finalstr`, `ip`) VALUES
(106, 'cjies', 'e10adc3949ba59abbe56e057f20f883e', 'CJ', 1, 'CJ', 'cijies@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-14 16:21:30', '2014-03-24 15:52:03', 0, '', '124.218.16.53'),
(105, 'jack055022', 'c855c6ac4f48c54d0e0cfbf817159504', 'Sham', 1, 'Sham', 'jack055022@yahoo.com.tw', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-12 18:33:41', '2014-03-24 15:52:03', 0, '', '124.218.16.53'),
(107, 'mbi92610', 'fee6f9bcb8c67af27ccdcc2562b5f20c', 'mbi92610', 1, 'mbi92610', 'mbi92610@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-15 00:49:43', '2014-03-24 15:52:03', 0, '', '124.218.16.53'),
(160, '', '', 'Gary Lai', 1, '', 'garylai1990@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100003544640331', '0', '', 0, '2013-06-22 00:36:16', '0000-00-00 00:00:00', 1, '', '36.237.12.43'),
(74, 'test12344321', '05a671c66aefea124cc08b76ea6d30', 'testtesttest', 1, 'testtesttest', 'test@test.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-04 03:53:19', '2014-03-24 15:52:03', 0, '719DE893', '124.218.16.53'),
(94, 'test', '', 'test', 0, 'test', 'swdmovement@gmail.com', 1, '', 1, '0000-00-00', 0, '', 0, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-05 00:58:39', '2014-03-24 15:52:03', 0, '852D9CF4', '124.218.16.53'),
(97, 'P36014072', '25f9e794323b453885f5181f1b624d0b', 'Hsu Yuan-Ling', 1, 'p36014072', 'tug428@yahoo.com.tw', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100002496101193', '0', '', 22, '2013-05-05 10:43:37', '2013-07-23 11:52:25', 1, '1DCC5361', '140.112.25.69'),
(98, 'skylovely2005', '25d55ad283aa400af464c76d713c07ad', '賴瑞晟', 1, 'LARRY', 'skylovely2005@hotmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-05 11:06:39', '2014-03-24 15:52:03', 0, '', '124.218.16.53'),
(99, 'whatever', '098f6bcd4621d373cade4e832627b4f6', 'whatever', 1, 'whatever', 'test@test.test', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-06 22:47:14', '2014-03-24 15:52:03', 0, '', '124.218.16.53'),
(100, 'whateverjustatest', '098f6bcd4621d373cade4e832627b4f6', 'whateverjustatest', 1, 'whateverjustatest', 'test@test.test', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-06 22:50:17', '2014-03-24 15:52:03', 0, '', '124.218.16.53'),
(101, 'demo', 'fe01ce2a7fbac8fafaed7c982a04e229', 'demo', 1, 'Account for demo', 'demo@demo.demo', 1, 'M', 1, '1993-03-04', 1, 'address', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-06 23:03:29', '2014-03-24 15:52:03', 1, '', '124.218.16.53'),
(159, '', '', '彭彥綸', 1, '', 'fred40104@yahoo.com.tw', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100000243141701', '0', '', 8, '2013-06-22 00:20:35', '2013-11-04 23:15:06', 1, '', '218.164.79.117'),
(103, 'justtotest', '098f6bcd4621d373cade4e832627b4f6', 'justtotest', 1, 'justtotest', 'test@test.test', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-11 21:54:00', '2014-03-24 15:52:03', 0, '', '124.218.16.53'),
(104, 'fongwh1', 'a6eb296c4541adf6d310cf2d0d831c2c', '馮偉康', 1, 'Will', 'fongwh1016@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-12 10:35:04', '2014-03-24 15:52:03', 0, '', '124.218.16.53'),
(158, 'registerTest', '81dc9bdb52d04dc20036dbd8313ed055', 'registerTest', 1, 'registerTest', '123@456.789', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-06-19 14:10:50', '2014-03-24 15:52:03', 0, '40CCD590', '124.218.16.53'),
(110, '92610', '1f8ec751dd7637fb82c6e8c224cac507', '92610', 1, '92610', 'a072519373@hotmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-15 01:23:42', '2014-03-24 15:52:03', 0, '', '124.218.16.53'),
(157, '', '', '章奈詩', 1, '', 'tangent23512@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100002475280928', '0', '', 0, '2013-06-19 11:20:19', '0000-00-00 00:00:00', 1, '', '140.116.1.134'),
(112, 'mbi5566', 'fee6f9bcb8c67af27ccdcc2562b5f20c', 'mbi5566', 1, 'mbi5566', 'mbi92610@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-15 14:03:06', '2014-03-24 15:52:03', 0, '', '124.218.16.53'),
(114, 'chia0910350500', '0862f398dd6fd6e2b3747fc0410aad57', '江佳佳', 1, 'chia0910350500@yahoo.com.tw', 'chia0910350500@yahoo.com.tw', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-15 17:35:12', '2014-03-24 15:52:03', 0, '', '124.218.16.53'),
(115, 'fivil52', '81dc9bdb52d04dc20036dbd8313ed055', '詹致遠', 1, 'fivil', 'fivil52@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-24 11:54:03', '2014-03-24 15:52:03', 0, '', '124.218.16.53'),
(116, '92610mbi', 'd92717156bbca92a08f0e8da054746a7', '92610mbi', 1, '92610mbi', 'mbi92610@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-29 01:11:13', '2014-03-24 15:52:03', 0, '', '124.218.16.53'),
(117, 'hika1990', '35a4f73da4e9fe670016d51f00d522a0', 'HIKA', 1, 'HIKA', 'hika1990@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-29 15:55:32', '2014-03-24 15:52:03', 0, '', '124.218.16.53'),
(118, 'reanna19910101', 'b427ebd39c845eb5417b7f7aaf1f9724', 'reanna', 1, 'reanna', 'reanna19910101@yahoo.com.tw', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-05-29 19:31:49', '2014-03-24 15:52:03', 0, '', '124.218.16.53'),
(132, '', '', '鄧維岱', 1, '', 'a55660988@yahoo.com.tw', 0, 'M', 0, '1993-03-04', 1, 'address test', 1, 'https://graph.facebook.com/100000154088866/picture?width=300', 1, '100000154088866', '0', '', 189, '2013-06-02 14:10:27', '2014-03-24 15:52:41', 1, '', '124.218.16.53'),
(121, '', '', 'Eddie Chiou', 1, '', 'smart0eddie@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com/100001077116829/picture?width=300', 1, '100001077116829', '0', '', 74, '2013-06-01 17:50:00', '2014-04-01 09:07:31', 1, '', '114.39.183.33'),
(125, 'justfortest', 'c830df6e9ba06988d27a14fc679e24c9', 'justfortest', 1, 'justfortest', 'justfortest@justfortest.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-06-01 18:35:54', '2014-03-24 15:52:03', 0, '', '124.218.16.53'),
(127, 'blablablalblab', 'df5ea29924d39c3be8785734f13169c6', 'blablablalblab', 1, 'blablablalblab', 'smart0eddie@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-06-01 18:22:58', '2014-03-24 15:52:03', 1, '22B9488F', '124.218.16.53'),
(150, '', '', 'Chi-En Chang', 1, '', 'gn01842919@yahoo.com.tw', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100000187795301', '0', '', 1, '2013-06-07 15:58:07', '2013-06-27 00:19:39', 1, '', '203.67.143.57'),
(151, '49725126', 'fa777e931022f9f3cec1097a04405faf', '陳子雍', 1, 'Yong ', '49725126@gm.nfu.edu.tw', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-06-07 22:49:16', '2014-03-24 15:52:03', 1, '8A949D96', '124.218.16.53'),
(133, '', '', 'Jui Cheng Lai', 1, '', 'skylovely2005@hotmail.com', 1, 'M', 1, '1992-07-02', 1, '', 1, 'https://graph.facebook.com/100000123203699/picture?width=300', 1, '100000123203699', '0', '', 29, '2013-06-02 22:26:49', '2014-04-04 12:00:50', 1, '', '1.168.164.8'),
(134, '', '', 'Ci Jie Tan', 1, '', 'xijietan@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '1089854948', '0', '', 1, '2013-06-02 22:58:20', '2013-06-19 22:04:50', 1, '', '140.116.112.137'),
(135, '', '', '吳紀憲', 1, '', 'jack055022@yahoo.com.tw', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100000340219325', '0', '', 0, '2013-06-02 23:02:37', '0000-00-00 00:00:00', 1, '', '211.20.170.44'),
(136, 'regtest', '098f6bcd4621d373cade4e832627b4f6', 'regtest', 1, 'regtest', 'etstsf@gsfdgas.sdfs', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-06-02 23:48:01', '2014-03-24 15:52:03', 0, '3CD32194', '124.218.16.53'),
(148, '', '', '林曜誠', 1, '', 'zeroroger2001@yahoo.com.tw', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100000366211155', '0', '', 0, '2013-06-06 23:13:27', '0000-00-00 00:00:00', 1, '', '140.116.131.233'),
(149, '', '', 'Leo Tsai', 1, '', 'l61012003@pchome.com.tw', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100001396411675', '0', '', 0, '2013-06-07 00:42:31', '0000-00-00 00:00:00', 1, '', '111.255.16.149'),
(139, '', '', '廖偉成', 1, '', 'ny881540@yahoo.com.tw', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100002589424777', '0', '', 2, '2013-06-03 15:49:45', '2013-06-03 16:10:52', 1, '', ''),
(140, '', '', '方毅', 1, '', 'fantasy-1022@hotmail.com', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100000051650119', '0', '', 0, '2013-06-04 14:55:41', '0000-00-00 00:00:00', 1, '', '140.116.72.131'),
(154, '', '', '陳嘉駿', 1, '', 'alf308230@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100000333164710', '0', '', 0, '2013-06-09 12:06:28', '0000-00-00 00:00:00', 1, '', '61.227.245.59'),
(147, '', '', '李哲良', 1, '', 'p9360915@yahoo.com.tw', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100000293179050', '0', '', 0, '2013-06-06 20:12:57', '0000-00-00 00:00:00', 1, '', '140.116.130.206'),
(145, 'deng_release', 'dd8e5d546cc400f95ce203cc82fe3c7a', 'deng_release', 1, 'deng_release', 'swdmovement@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-06-06 18:28:27', '2014-03-24 15:52:03', 0, '096C14B3', '124.218.16.53'),
(143, 'dtest', '4daeee5f6c840ba3907d0ce50efc9822', 'dtest', 1, 'dtest', 'swdmovement@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-06-05 20:32:21', '2014-03-24 15:52:03', 1, '33F55803', '124.218.16.53'),
(146, '', '', 'Will Fong', 1, '', 'will_unpredictable@hotmail.com', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '1412161583', '0', '', 14, '2013-06-06 18:36:35', '2013-07-24 09:07:40', 1, '', '61.219.187.151'),
(156, '', '', '呂科進', 1, '', 'jimmylu0808@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100002111481634', '0', '', 1, '2013-06-14 13:14:12', '2013-06-14 13:16:50', 1, '', '61.227.241.247'),
(155, '', '', '詹致遠', 1, '', 'fivil52@hotmail.com', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100000050815169', '0', '', 1, '2013-06-10 21:34:45', '2013-06-10 21:35:10', 1, '', '58.114.111.103'),
(152, 'ggsmida', 'c1ebb4933e06ce5617483f665e26627c', 'okayama', 1, 'okayama', 'bewitchsky@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-06-07 23:54:14', '2014-03-24 15:52:03', 1, '337E6174', '124.218.16.53'),
(153, '', '', '黃彥周', 1, '', 'yjhyjhyjh0@yahoo.com.tw', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100000295784611', '0', '', 1, '2013-06-09 08:58:42', '2013-06-21 17:22:51', 1, '', '140.116.1.134'),
(161, '', '', 'Vivian Hu', 1, '', 'peimus629@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '1348374508', '0', '', 2, '2013-06-25 02:51:38', '2013-06-25 16:33:25', 1, '', '140.116.243.66'),
(162, 'asdasd', 'a8f5f167f44f4964e6c998dee827110c', 'afsa', 1, 'asfas', 'f@bab.im.r', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-06-25 22:01:36', '2014-03-24 15:52:03', 0, '99645A96', '124.218.16.53'),
(164, 'admin', '81dc9bdb52d04dc20036dbd8313ed055', 'Administrator', 1, 'Ad', 'guofu9743@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '0', '', 13, '2013-07-02 00:46:09', '2014-03-24 15:52:03', 1, '347797D2', '124.218.16.53'),
(163, '', '', '傅子豫', 1, '', 'ert889@yahoo.com.tw', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '1281837580', '0', '', 0, '2013-06-27 00:19:59', '0000-00-00 00:00:00', 1, '', '123.195.107.185'),
(170, '', '', '小鄧', 1, '', 'a55660988@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '115705761524935861118', '', 13, '2013-07-04 20:18:50', '2014-03-24 15:52:03', 1, '', '124.218.16.53'),
(172, '', '', 'JY Chiou', 1, '', 'smart0eddie@gmail.com', 1, 'M', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '106978821070527189092', '', 13, '2013-07-04 20:28:12', '2014-03-24 15:52:03', 1, '', '124.218.16.53'),
(171, '', '', 'movement swd', 1, '', 'swdmovement@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '109476857580384104522', '', 13, '2013-07-04 20:24:45', '2014-03-24 15:52:03', 1, '', '124.218.16.53'),
(173, '', '', 'Larry Lai', 1, '', 'skylovely2005@gmail.com', 1, 'M', 1, '1992-07-02', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '114758866806300796457', '', 13, '2013-07-04 21:29:33', '2014-03-24 15:52:03', 1, '', '124.218.16.53'),
(174, '', '', 'Kevin D Chang', 1, '', 'wenchan3918@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '1082231972', '', '', 0, '2013-07-24 17:22:55', '0000-00-00 00:00:00', 1, '', '114.45.203.12'),
(175, '', '', '糯米六', 1, '', 'linda_221620@yahoo.com.tw', 1, 'F', 1, '0000-00-00', 1, '', 1, '0', 1, '1682931411', '', '', 0, '2013-07-24 18:21:30', '0000-00-00 00:00:00', 1, '', '111.241.122.50'),
(176, '', '', 'Lemon Lin', 1, '', 'lemoncookie0518@yahoo.com.tw', 1, 'F', 1, '1985-05-18', 1, '', 1, '0', 1, '625973977', '', '', 0, '2013-07-24 18:28:03', '0000-00-00 00:00:00', 1, '', '61.219.187.217'),
(177, '', '', 'Emily Lin', 1, '', 'emilyatg@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '1471577235', '', '', 0, '2013-07-25 13:37:47', '0000-00-00 00:00:00', 1, '', '114.35.122.5'),
(178, '', '', 'Chi-En Chang', 1, '', 'gn01842919@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '115568043640101700502', '', 13, '2013-07-26 00:48:32', '2014-03-24 15:52:03', 1, '', '124.218.16.53'),
(179, '', '', 'Yen-Ching Chen', 1, '', 'ms0777648@yahoo.com.tw', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100000269903147', '', '', 0, '2013-08-19 09:19:23', '0000-00-00 00:00:00', 1, '', '218.164.2.88'),
(180, '', '', 'Apoil Cheng', 1, '', 'seanqazwsx@hotmail.com', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100000113663149', '', '', 0, '2013-08-19 10:26:21', '0000-00-00 00:00:00', 1, '', '59.127.163.168'),
(181, '', '', 'TwMaster Anson', 1, '', 'ismdog1234@yahoo.com.tw', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '100000123952125', '', '', 0, '2013-08-22 00:03:26', '0000-00-00 00:00:00', 1, '', '123.194.129.41'),
(182, 'siaomu', 'ca22878a3a6feeabc8f51701699e1b5e', '程建宇', 1, '變種羊', 'siaomucheng@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '', '', 13, '2013-08-25 14:00:51', '2014-03-24 15:52:03', 0, '14B9DA4B', '124.218.16.53'),
(183, '', '', 'Siaomu Cheng', 1, '', 'siaomu@hotmail.com', 1, 'M', 1, '1991-03-28', 1, '', 1, '0', 1, '1099492925', '', '', 0, '2013-08-25 14:01:46', '0000-00-00 00:00:00', 1, '', '123.240.44.29'),
(189, 'sinanata', '6843e3737b397b64d094e0d688146f52', 'Sinan Ata', 1, 'sinanata', 'sinanata@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '', '', 13, '2013-12-31 18:09:36', '2014-03-24 15:52:03', 0, 'EBE0C74A', '124.218.16.53'),
(184, '', '', '施小史', 1, '', 'jaxon0523@gmail.com', 1, 'M', 1, '0000-00-00', 1, '', 1, '0', 1, '1499448590', '', '', 2, '2013-09-02 22:36:11', '2013-09-05 16:59:59', 1, '', '114.36.233.22'),
(185, '', '', 'Wen-chi Kuo', 1, '', 'vanyachi@hotmail.com', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '1063914422', '', '', 0, '2013-09-03 00:07:27', '0000-00-00 00:00:00', 1, '', '220.135.4.198'),
(186, 'jaxon0523', '3e4b56a4b4b8a80850d571c4668c7ba8', '師小史', 1, '小史', 'jaxon0523@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '', '', 13, '2013-09-05 16:59:48', '2014-03-24 15:52:03', 1, '3DBF6018', '124.218.16.53'),
(187, '', '', '彭彥綸', 1, '', 'fred40104@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '101458466176052304530', '', 13, '2013-10-16 14:16:39', '2014-03-24 15:52:03', 1, '', '124.218.16.53'),
(188, 'asdf', '912ec803b2ce49e4a541068d495ab570', 'asdf', 1, 'asdf', 'fred4fwe0dewdw1f04@hotmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '', '', 13, '2013-11-04 23:14:53', '2014-03-24 15:52:03', 0, 'BFBD909B', '124.218.16.53'),
(190, '', '', 'heng ct', 1, '', 'heng.ct093@gmail.com', 1, '', 1, '0000-00-00', 1, '', 1, 'https://graph.facebook.com//picture?width=300', 1, '', '102978896938777765662', '', 13, '2014-01-16 14:14:36', '2014-03-24 15:52:03', 1, '', '124.218.16.53'),
(191, '', '', 'Ou-Yang Yen', 1, '', 'ouyang0916@hotmail.com', 1, '', 1, '0000-00-00', 1, '', 1, '0', 1, '1044679692', '', '', 0, '2014-02-19 12:52:41', '0000-00-00 00:00:00', 1, '', '140.116.156.245');

-- --------------------------------------------------------

--
-- 表的结构 `movements`
--

CREATE TABLE IF NOT EXISTS `movements` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `No` int(11) NOT NULL DEFAULT '101',
  `name` varchar(100) DEFAULT NULL,
  `category` tinyint(3) unsigned DEFAULT NULL,
  `city` varchar(100) DEFAULT NULL,
  `intro` text,
  `date_start` date DEFAULT NULL,
  `date_end` date DEFAULT NULL,
  `time_start` time DEFAULT NULL,
  `time_end` time DEFAULT NULL,
  `location` text,
  `host_account` int(11) DEFAULT NULL,
  `post_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `joins` int(11) DEFAULT NULL,
  `support` int(10) unsigned DEFAULT NULL,
  `donate` int(10) unsigned DEFAULT NULL,
  `host` text,
  `url` text,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=308 ;

--
-- 转存表中的数据 `movements`
--

INSERT INTO `movements` (`id`, `No`, `name`, `category`, `city`, `intro`, `date_start`, `date_end`, `time_start`, `time_end`, `location`, `host_account`, `post_time`, `joins`, `support`, `donate`, `host`, `url`) VALUES
(10, 101, '520農民運動 ', 8, 'Yunlin', '1988年春季，政府決定擴大開放外國農產品進口台灣的數量與種類，引起大多數農民的質疑和恐慌。1988年5月20日，林國華、蕭裕珍等人率\n\n領雲林縣農權會，以農業開放可能導致農民權利受損為抗議目標，主導台灣南部農民北上台北市請願，提出全面農保、全面眷保、肥料自由\n\n買賣、增加稻米保證價格與收購面積、廢止農會總幹事遴選、廢止農田水利會會長遴選、成立農業部、農地自由買賣七項要求。 ', '1988-05-20', '1988-05-20', '14:00:00', '00:00:00', '台北車站-中正紀念堂 ', 0, '2013-04-03 08:13:28', 0, 0, 0, '', ''),
(231, 101, '320「我愛台灣、不要核災」遊行', 2, 'Taipei', '『我愛台灣、不要核災』希望透過這樣的遊行活動，喚起台灣民眾愛台灣、反核災的危機意識，鞭策政府改弦更張，放棄核能擴張政策，早日落實非核家園願景。', '2011-03-20', '2011-03-20', '13:30:00', '00:00:00', '中正紀念堂大忠門', 0, '2013-05-12 08:12:03', 0, 0, 0, '', ''),
(232, 101, '孩子要爸爸，我們要人權', 8, 'Taipei', '在移民署訂定的「藏籍配偶申請居留通則」下，台藏聯姻登記結婚後，需經2到3年的審查期，才會視審查結果給發居留證。這段期間藏配沒有居留證、健保與工作權，此外每半年更需出境1次，使台藏家庭的生活陷入困境。他們表達「孩子要爸爸，我們要人權」的訴求，他們希望移民署能盡快針對通則檢討與修正，不過，陳情後的協調會未果，移民署代表僅表示：會往放寬方向「再努力」。', '2013-05-10', '2013-05-10', '00:00:00', '00:00:00', '行政院', NULL, '2013-05-12 08:13:40', 1, 0, 0, 'http://ttfra.blogspot.tw/', '台藏家庭人權聯盟'),
(13, 101, '519綠色行動 ', 4, 'Taipei', ' 自從1949年5月19日以來，國民政府於台灣實行台灣省戒嚴令，並且以動員戡亂時期的法律作為最高法律，《中華民國憲法》規定的自由權與人權都受到嚴重限縮。鄭南榕、江鵬堅等黨外運動人士於1980年代推動519綠色行動，以「紀念台灣戒嚴日」為由，要求國民政府解嚴。\n\n1986年5月19日，鄭南榕等人於台北市艋舺龍山寺聚集數百名群眾，被鎮暴警察層層包圍，以人牆圍堵僵持10多個小時。此一行動在當時也被認為是黨外運動激進派不滿黨外公政會主導人事與國民黨方面溝通時，採取較為妥協、軟弱的立場。', '1986-05-19', '1986-05-19', '00:00:00', '00:00:00', '艋舺龍山寺', 0, '2013-04-03 09:13:11', 0, 0, 0, '', ''),
(230, 101, '台大工安出代誌', 10, 'Taipei', '由各系所學生組成的「台大工安出代誌監督聯盟」，今日（5/11）在日本建築師伊東豊雄設計的台大社會科學院新建物剪綵現場，懸掛布條、表達抗議，呼籲校方勿再逃避校園工程安全的責任。台大社科院於施工期間，兩個月內連續發生兩起工人死亡的重大工安事故。作為台灣首府大學的台大，卻在五年內發生三件死亡重大職災，「台大工安出代誌監督聯盟」要求台大應有專人負責工安、成立專責單位監督工安、工程資訊透明化。', '2013-05-11', '2013-05-11', '00:00:00', '00:00:00', '台大社科院', 0, '2013-05-12 08:04:54', 3, 0, 0, '台大工安出代誌監督聯盟', 'http://www.coolloud.org.tw/node/74162'),
(20, 101, '925白玫瑰集會', 8, 'Taipei', '925白玫瑰運動，在台灣發動的一場連署抗議遊行，因為部分民眾法院對兒童性侵輕判所發起，為政府核准，屬於合法集會。2010年9月25日，於台灣發起的連署抗議活動，目的是要求汰換不適任的法官，並建立起性侵案件專家證人制度，以維護兒童人權。', '2010-09-25', '2010-09-25', '18:00:00', '22:00:00', '凱達格蘭大道', 0, '2013-04-03 10:06:18', 0, 0, 0, '正義聯盟', 'http://www.xteam.tw/462'),
(237, 101, '49工人抗議', 6, 'Taipei', '美國在台協會（AIT）內湖新館工程發生美商欠款糾紛，被積欠工程款的台灣承包商偉銓營造、鋐原能源和承和營造，3月底與美國承攬建商衛斯頓公司（Weston Solutions, Inc.）協商破局後，展開一連串抗議。', '2013-04-09', '2013-04-09', '15:00:00', '00:00:00', 'AIT內湖新館', NULL, '2013-05-12 09:13:01', 0, 0, 0, '', ''),
(25, 101, '反五輕運動', 4, 'Kaohsiung', '後勁反五輕運動是1987年中油公司與中華民國政府決定在高雄煉油廠增設第五輕油裂解廠（簡稱「五輕」）後，所引發的一系列環保抗爭運動。期間曾舉辦公民投票，最後在中油承諾回饋金與未來遷廠的情況下動工。\n\n1987年6月，中油的「第五輕油裂解廠」計畫正式於媒體上發佈。同年7月2日時，居民與其他抗議人士開始在後勁地區宣傳抗爭活動，並且在7月3日至煉油廠北門發表演講。 ', '1987-10-20', '1987-10-20', '00:00:00', '00:00:00', '台北環保署-立法院 ', 0, '2013-04-03 10:09:35', 0, 0, 0, '', ''),
(234, 101, '苑裡反瘋車接力絕食', 10, 'Taipei', '風力發電是我們值得鼓勵的再生能源，但如果任憑業者為所欲為，綠能反倒變成傷害，這是我們不允許的。\n我們需要綠能和人民共同生存的政策。', '2013-04-17', '2013-04-17', '10:30:00', '00:00:00', '行政院', NULL, '2013-05-12 08:49:06', 1, 0, 0, 'https://www.facebook.com/events/363088867130973/', '苑裡反風車自救會'),
(233, 101, '中台灣同志大遊行', 7, 'Taichung', '「台灣伴侶權益推動聯盟」也將在今年9月把「同性婚姻、伴侶制度、多人成家」送進立法院，大家都熱切期盼。我們希望國際雙性戀旗、國際跨性別旗、和原住民、陰陽人（intersex）、身心障礙等特別不容易被看見的少數群體標誌，都能夠在同志場合的彩虹旗中，差異而多樣地綻放，並讓「婚姻平權」與「跨性別平權」都能夠合法通過！', '2013-05-18', '2013-05-18', '13:00:00', '00:00:00', '草悟道 ', 0, '2013-05-12 08:33:40', 2, 0, 0, '中台灣同志遊行聯盟', 'https://www.th-th.connect.facebook.com/tccpride'),
(228, 101, '510血汗醫院抗議', 6, 'Taipei', '台灣基層護理產業工會上百人今（10）天赴衛生署前抗議，丟出蒐自全台一百多雙護士鞋，諷刺衛生署放任醫院用「跨科、超時、花班、低薪」的四大兇器cost down（壓低成本），也反對政府自由經濟示範區政策、要求停止醫院公司化。', '2013-05-10', '2013-05-10', '10:00:00', '00:00:00', '台北市衛生署', 0, '2013-05-12 07:40:30', 1, 0, 0, '基層護理產業工會陳玉鳳', 'http://www.facebook.com/powerful.nurses?filter=3'),
(229, 101, '全教總525行動', 8, 'Taipei', '年金改革案的不公不義，你我的委屈和憤怒高漲，所以要「打掉爛案，導正改革」。而政府打算將中小學教評會修改成沒有明定專任教師比例，加進一堆外人，你我的「續聘」和「長聘」不保，更別說「停聘」、 「不續聘」、「解聘」輕易的就會發生在你身上，所以要阻擋惡修教評會。經過會員代表大會和縣市理事長會議，ㄧ致決定採取明確行動。', '2013-05-25', '2013-05-25', '15:00:00', '17:00:00', '凱達格蘭大道', 0, '2013-05-12 07:44:25', 4, 0, 0, '全國教師總工會', 'https://www.facebook.com/NFTU525ACTIVITY/info'),
(31, 101, '四六事件 ', 8, 'Taipei', '四六事件起於1948年，以臺灣省立師範學院（今國立臺灣師範大學）為主體，串聯國立臺灣大學所發起要求提高公費待遇的「反飢餓鬥爭」，以「救苦、救難、救饑荒」為主的學生運動。當時有不少中國大陸的學生流亡台灣並在台大與師大就讀，而且當時台灣有不少的知識份子都有社會主義的素樸理想，其中不乏由於對國民政府失去信心而對中國共產黨尋求精神寄託者，導致中國大陸的學生運動與臺灣的學生運動合流。之後引發政府當局大規模逮捕學生的行動。\n \n3月21日，臺大與師院的學生選派代表前往台北市警察總局請願，陪同請願的學生與民眾超過1000人並包圍警局，致使警方在群眾壓力下被迫道歉。然而學生沿路高唱中國大陸的學運歌曲《你是燈­塔》、《跌倒算什麼》，並且高呼中國大陸的學運口號：「­反內戰」、「反飢餓」、「反迫害」，引發當局高度關切，認定校園受到中國共產黨的統戰與滲透。', '1949-03-21', '1949-03-21', '00:00:00', '00:00:00', '警察總局 ', 0, '2013-04-03 10:18:58', 0, 0, 0, '', ''),
(226, 101, '農產中心馬跳票', 10, 'Changhua', '「馬總統你食言了！」總統馬英九民國九十八年到彰化縣埔鹽鄉廍子社區參訪時，曾允諾協助該村設置農特產物流中心，但此項允諾四年多來一直未實現，引起該村村民不滿，昨天集體站出來要求馬英九實現諾言，不要把農民當「憨民」。', '2013-05-07', '2013-05-07', '00:00:00', NULL, '埔鹽鄉廍子社區', 0, '2013-05-11 07:28:36', 0, 0, 0, '施來平', '無'),
(227, 101, '關廠工人，絕食拚老本', 6, 'Taipei', '由於全關連與勞委會長期無法就「貸款」與「代位求償」認定得出共識，全關連因而在今（4/28）下午前往勞委會發起「無限期絕食抗爭」，強調勞委會再不出面與勞工代表協商，他們就要用身體抗爭到倒下為止。\n\n此次抗爭全關連共提出三大訴求：（1）工人權利不打折，勞委會立即就代位求償一事出面協商。（2）修改勞基法第28條，將資遣費、退休金納入「積欠工資墊償基金」保障範圍。（3）以公投方式複決年金改革方案，反對「繳多、領少、延後領」。', '2013-04-28', '0000-00-00', '13:28:00', '00:00:00', '勞委會', NULL, '2013-05-12 07:30:50', 0, 0, 0, 'https://www.facebook.com/photo.php?fbid=471287919615011&set=a.361163823960755.82336.342713572472447&type=1&theater', '全國關廠工人連線'),
(33, 101, '反美牛 401靜默遊行 ', 4, 'Taipei', '【行動訴求】401愚人節，抗議政府愚民政策。抗議政府開放瘦肉精美牛，三管五卡破功、開放美牛黑箱作業，陳冲瀆職拒下台。公佈有條件開放帶瘦肉精美牛「全民公敵之黑心立委」 ', '2012-04-01', '2012-04-01', '19:00:00', '00:00:00', '自由廣場 ', 0, '2013-04-03 11:50:54', 0, 0, 0, '', ''),
(35, 101, '沙灘、海洋、fudafudak─永遠的天堂 ', 8, 'Taipei', '參加純海洋音樂饗宴，反對美麗灣，守護東海岸，捍衛海洋的生存權。 ', '2012-07-28', '2012-07-28', '10:00:00', '00:00:00', '海邊的卡夫卡', 0, '2013-04-03 12:21:42', 0, 0, 0, '', ''),
(37, 101, '327反廢死大遊行 ', 10, 'Taipei', ' 反對廢除死刑聯盟認為，社會上對受害者家屬沒有足夠的關懷及包容心，因此號召全台人民們在3/27晚上六點半在凱達格蘭大道上和受害者家屬們站在一起，表達民眾對受害者和家屬的支持、聆聽他們的故事。 ', '2010-03-27', '2010-03-27', '18:30:00', '00:00:00', '凱達格蘭大道 ', 0, '2013-04-03 13:22:06', 0, 0, 0, '', ''),
(38, 101, '南山人壽業務員遭解僱 工會抗爭 ', 6, 'Taipei', ' 南山人壽業務員先前向勞保局檢舉南山逃漏勞健保，結果卻遭資方提告並解僱。近千名南山人壽業務員昨赴南山民權大樓抗議，除聲援遭解僱的業務員，也要求廢止「十五日條款」保障工作權。 ', '2013-04-02', '2013-04-02', '00:00:00', '00:00:00', '南山民權大樓 ', 0, '2013-04-03 14:02:18', 0, 0, 0, '', ''),
(39, 101, '我要12年國教大遊行 ', 5, 'Taipei', ' 2009年7月，由全國家長團體聯盟、中華民國教育改革協會、人本教育基金會 等民間團體組成之「我要十二年國教聯盟」發起在國中基本學力測驗結束當天的「七一二我要十二年國教」遊行。遊行訴求為：\n1.立即宣佈民國101年開始實施12年國民基本教育\n2.明訂每年編列200億專案預算，十年內專用於12年國教，教育經費由21.5%調高到22.5%。 \n3.實施真正免試升高中職，才有優質教育、快樂學習及全球競爭力！\n4.免試：不要採計在校成績---要廢除基測免試上高中職\n5.優質：不要岐視，要讓每個人都讀優質的高中職\n6.快樂：不要扭曲的生活，要健康快樂的身心靈\n7.競爭力：不要罐頭工廠，要有競爭力的適性教育', '2009-07-12', '2009-07-12', '14:00:00', '00:00:00', '自由廣場-凱達格蘭大道 ', 0, '2013-04-04 07:42:12', 0, 0, 0, '', ''),
(55, 101, '人民火大、一路嗆馬 ', 9, 'Taipei', ' 民進黨舉辦「人民火大、一路嗆馬」遊行，將表達換內閣救經濟、召開國是會議、駁回壹傳媒交易案三大訴求。黨主席蘇貞昌也將宣示未來的行動，為下階段罷免立委、總統鋪路。 ', '2013-01-13', '2013-01-13', '14:00:00', '00:00:00', '台北市政府-凱達格蘭大道 ', 0, '2013-04-07 12:55:17', 0, 0, 0, '', ''),
(59, 101, '同志成家，帶伴回家 ', 7, 'Hualien', '今年的花蓮彩虹嘉年華，\n反思與綜觀前兩屆的經驗，\n決定以：「同志成家，帶伴回家」作為主題。\n\n希望同志除了可以在遠離家鄉的地方自由戀愛、自由成家外，\n也能夠帶著伴侶回家，得到家人的祝福與接納。', '2013-05-04', '2013-05-04', '13:00:00', '00:00:00', '舊鐵道行人徒步區 ', 0, '2013-04-12 08:30:23', 0, 0, 0, '', ''),
(60, 101, '勞工要安全、拚未來 ', 6, 'Taipei', '此次五一大遊行乃以勞保年金改革為抗議主軸，將提出七大訴求：反對勞保年金修惡、基本工資調漲應制度化、落實集體協商制度、資遣費、退人金納入工資墊償、勞基法一體適用、本勞外勞同工同酬、終結責任制以及過勞死。 ', '2013-05-01', '2013-05-01', '00:00:00', '00:00:00', '', 0, '2013-04-17 01:55:48', 0, 0, 0, '', ''),
(235, 101, '護士抗議血汗坐月子中心', 9, 'HsinChu', '新竹縣佑康產後護理中心內的7名護士，不滿公司加班費未依勞基法計算，勞保及勞退金更「以多報少」影響員工權益，護士集體向公司追討無效後，14日冒雨到公司前舉牌抗議，大叫「員工累到哭，寶寶哭到淚！」控訴佑康是血汗護理中心。', '2013-04-15', '2013-04-15', '00:00:00', '00:00:00', '竹北市佑康產後護理中心', NULL, '2013-05-12 08:59:17', 0, 0, 0, '', ''),
(236, 101, '519反核行動，終結核電大遊行', 2, 'Taipei', '立即停建核四！反對鳥籠公投！為再次宣示我們反核的主張和要求，並希望執政黨在黨團協商期間能重新審思其不當的作為，我們計畫於總統就職周年前一日再上街頭，舉辦反核遊行。', '2013-05-19', '2013-05-19', '14:00:00', '22:00:00', '', 0, '2013-05-12 09:05:33', 3, 0, 0, '台灣反核行動聯盟', 'https://www.facebook.com/photo.php?fbid=438815819542643&set=a.438815816209310.1073741829.438706412886917&type=1&relevant_count=1'),
(172, 101, '農民之路（La Via Campesina）', 10, 'Taipei', '來自全台各地的農民，協同農民之路東亞－東南亞區域各國代表，分別以土地掠奪、反自由貿易、反基改與保種、能源與氣候變遷、生態農業為主題進行論壇，除分享各國經驗，也要對目前不當的農業政策進行總體檢。', '2013-02-03', '2013-02-03', '14:00:00', '00:00:00', '凱達格蘭大道', 0, '2013-04-23 11:38:56', 0, 0, 0, '', ''),
(173, 101, '師大商圈住民自救會', 9, 'taipei', '大量人潮帶來噪音喧嘩、垃圾汙染、油煙異味、消防安全、停車問題、治安危機以及一樓開店二樓以上房價貶值的巨大損失。而巨大的利益糾葛之下，已有商家及攤販被潑油漆，也有商家被仇家砸店傷及無辜消費者。暴力、黑道陰影籠罩讓無辜居民生活在巨大心理壓力之下。', '2011-10-26', '2011-10-26', '18:30:00', '00:00:00', '泰順街-辛亥區民活動中心', 0, '2013-04-23 11:44:18', 0, 0, 0, '', ''),
(174, 101, '反教育商品會聯盟', 5, 'Taipei', '一、不撤案，就下台！\n一、廢除學費調漲方案，擬定學費逐年調降方案，並優先調降私立大專費用。\n二、為修正並擴大教育投入費用，應立即面對教育係屬培育產業人才目的，課徵資本利得稅。', '2013-04-17', '2013-04-17', '08:03:00', '00:00:00', '教育部', 0, '2013-04-23 11:48:33', 0, 0, 0, '', ''),
(175, 101, '119勞工自救大遊行', 6, 'Taipei', '不滿馬政府遲遲未端出勞保年金方案，台南市產業總工會等多個縣市工會與團體昨在凱達格蘭大道前宣布，周六下午1時發起「119勞工自救大遊行」，預計5000名勞工將把萬顆番茄與雞蛋丟向總統府，表達勞工的憤怒。', '2013-01-19', '2013-01-19', '13:00:00', '00:00:00', '凱達格蘭大道', 0, '2013-04-23 11:51:49', 0, 0, 0, '', ''),
(176, 101, '高師崛起', 5, 'Kaohsiung', '1.教育即自由的實踐，身體及行動自主權應交還學生，而非校方或監護人。\n2.均衡校區資源，校區分割的成本，不應由學生承擔。\n3.校務的發展及校園公共事務的決定，應經由學生充分參與和討論，催生民主友善的大學校園。', '2010-03-15', '2010-03-15', '00:10:00', '00:00:00', '高師大燕巢校區', 0, '2013-04-23 11:54:16', 0, 0, 0, '', ''),
(202, 101, '《不要告別東海岸》徒步行動', 8, 'Taitung-Taipei', '杉原灣的美麗灣BOT開發案先蓋好再環評，破壞環評體制、摧毀環境生態與原住民族傳統領域。而我們美麗的東海岸在缺乏完整國土規劃與願景下，淪為財團圈地競賽、大蓋水泥建築物的情況。守護豐富生態、在地覺醒與自決，我們將一步一腳印徒步行腳，深入認識在地議題、並串聯守護力量！', '2013-04-04', '2013-04-20', '09:00:00', '00:00:00', '杉原-凱達格蘭大道', 0, '2013-05-11 01:25:13', 0, 0, 0, '反反反行動聯盟', 'http://e-info.org.tw/node/84462'),
(178, 101, '519嗆馬踹共大遊行', 9, 'Taipei', '2012年1月14日大選過後，4個月的時間內，一連串油電雙漲、隱匿禽流感疫情、開放瘦肉精美國牛肉進口等政策，引發民怨。民進黨於5月19日（週六）下午3時與民間社團將發起「日子歹過，總統踹共」519、520嗆馬大遊行活動，要求馬英九向人民道歉，並撤換行政院長陳冲。', '2012-05-19', '2012-05-19', '15:00:00', '00:00:00', '北平東路', 0, '2013-04-23 12:26:56', 0, 0, 0, '', ''),
(240, 101, '核災27周年纪念', 2, 'Taipei', '核四公投提案26日三度在立法院表决，適逢車诺比核災27周年纪念日，全國廢核行動平台與多个廢核團體齊聚立法院大門外，舉辦“車諾比27周年纪念與反對陷阱公投立法院行動”，20多名反核人士身穿白色輻射防護衣，並戴上口罩、面罩，以行動劇模擬當核災警示聲響起，他们陸續倒在地上，意指核災带来的威脅與危險。', '2013-04-26', '2013-04-26', '00:00:00', '00:00:00', '立法院', NULL, '2013-05-12 09:29:53', 0, 0, 0, '', ''),
(180, 101, '2011秋鬥', 9, 'taipei', '工運團體之外，還有反核團體、各地面臨土地被徵收威脅的農民、房屋被都更的農民、日日春協會與性別團體，以及外字輩的台灣國際勞工協會TIWA、南洋台灣姊妹會、人民老大不合格公民團，都上台表演精彩的搖頭節目，並發表秋鬥宣言。', '2011-11-12', '2011-11-12', '16:00:00', '00:00:00', '凱達格蘭大道', 0, '2013-04-23 12:34:48', 0, 0, 0, '', ''),
(225, 101, '二二八 6 6 週年紀念活動勿忘「三月屠殺」', 9, 'Taipei', '1947年228悲劇發生迄今已66年。今年由民間團體發起紀念活動，除了當天遊行、音樂會外，將特別強調「勿忘3月屠殺」，以凸顯當年3月8日國軍基隆登陸後，陸續於台灣各地展開的屠殺事件。他們也質疑，國民黨主席馬英九一方面道歉，另一方面卻跑去向228元兇蔣介石謁靈；一方面歌頌受難者王添灯、一方面褒揚詆毀王添灯的研究者黃彰健。就是因為台灣社會對於228的歷史認識模糊，才讓國民黨政府有這種歷史錯亂操作的空間。', '2013-02-28', '2013-02-28', '13:00:00', '00:00:00', '永樂市場', 0, '2013-05-11 07:24:18', 0, 0, 0, '姚嘉文', 'http://www.wufi.org.tw/%E4%BA%8C%E4%BA%8C%E5%85%AB-6-6-%E9%80%B1%E5%B9%B4%E7%B4%80%E5%BF%B5%E6%B4%BB%E5%8B%95-%E5%8B%BF%E5%BF%98%E3%80%8C%E4%B8%89%E6%9C%88%E5%B1%A0%E6%AE%BA%E3%80%8D/'),
(183, 101, '我願游泳於樹海．搶救江翠老樹', 1, 'new-Taipei', '建校以來，校園中的老樹陪伴著師生及社區居民們走過生活點滴，但校園內的一起興建工程，卻逼迫這群居住超過30年的老樹們搬離現址，\n\n原文網址: 江翠老樹「抱建校以來，校園中的老樹陪伴著師生及社區居民們走過生活點滴，但校園內的一起興建工程，卻逼迫這群居住超過30年的老樹們搬離現址。', '2013-03-28', '0000-00-00', '06:00:00', '00:00:00', '江翠國中', 0, '2013-04-23 12:37:55', 0, 0, 0, '江翠國中退休老師與在地居民', 'https://www.facebook.com/swimmingintreesea'),
(186, 101, '拒黑手、反壟斷，要新聞自由！', 8, 'Taipei', '一、政府勿裝死、嚴審併購案：要求公平會、NCC、金管會等主管機關，依照國會通過的八項決議，積極嚴審壹傳媒併購案。\n二、反媒體壟斷、要立法：政府在完成《跨媒體壟斷法》立法前，不得通過任何包括本案的爭議媒體併購案。\n三、反中國因素干預、要政府表態：反對中國因素干預台灣媒體自由，要求政府對此現象表態，提出應對之道。\n四、力保新聞自主、聲援壹傳媒工會：要求壹傳媒資方立刻依照工會主張，簽訂《團體協約》及《編輯室公約》。保障新聞自主及基層工作者勞動權益。', '2012-11-26', '2012-11-26', '14:00:00', '00:00:00', '行政院', 0, '2013-04-23 12:45:37', 0, 0, 0, '反媒體巨獸青年聯盟', 'http://www.idontwantwantleague.blogspot.tw/2012/12/20121126.html'),
(187, 101, '901反媒體壟斷大遊行', 8, 'taipei', '要新聞專業、要旺中道歉、要NCC監督、反媒體壟斷。', '2012-09-01', '2012-09-01', '14:00:00', '00:00:00', '中國時報大樓', 0, '2013-04-23 12:48:00', 0, 0, 0, '反媒體巨獸青年聯盟', 'http://www.idontwantwantleague.blogspot.tw/'),
(188, 101, '反媒體巨獸元旦行動', 8, 'Taipei', '當公平會自我設限，只從仲裁市場競爭的角度看待壹傳媒併購案時。我們也一再提醒，大眾媒體是社會公器，此案事涉公共利益、國家安全。但整個行政團隊乃至國民黨團，只用尊重專業審查機關作為托詞，對資本壟斷媒體、中囯因素介入不置一詞。', '2012-12-31', '2013-01-01', '19:00:00', '00:00:00', '自由廣場', 0, '2013-04-23 12:50:11', 0, 0, 0, '反媒體巨獸青年聯盟', 'http://www.idontwantwantleague.blogspot.tw/2013/01/20121231_18.html'),
(189, 101, '第四屆 高雄同志大遊行', 7, 'Kaohsiung', '第四屆高雄同志大遊行以「空間革命，異同佔領」為主題，從同志的生活「空間」看「多元」，並希望「異同」支持，以建立「同志友善空間」。', '2013-06-29', '2013-06-29', '12:30:00', '00:00:00', '生日公園', 0, '2013-04-23 12:50:49', 0, 0, 0, '高雄同志遊行聯盟', 'http://khpride6.pixnet.net/blog/post/96320068-%E7%AC%AC%E5%9B%9B%E5%B1%86-%E9%AB%98%E9%9B%84%E5%90%8C%E5%BF%97%E5%A4%A7%E9%81%8A%E8%A1%8C%E3%80%90%E7%A9%BA%E9%96%93%E9%9D%A9%E5%91%BD%EF%BC%8C%E7%95%B0%E5%90%8C%E4%BD%94'),
(190, 101, '反媒體壟斷「國民黨團，說話要算話！」', 8, 'Taipei', '─壓陣立院，緊盯廣電三法修正案進程', '2013-01-11', '2013-01-11', '11:00:00', '00:00:00', '立法院', 0, '2013-04-23 12:51:59', 0, 0, 0, '反媒體巨獸青年聯盟', 'http://www.idontwantwantleague.blogspot.tw/'),
(191, 101, '再戰公平會', 8, 'Taipei', '壹傳媒併購案已正式簽約，公平交易委員會將是旺中集團蔡衍明併購壹傳媒平面媒體的唯一審核關卡。旺中併《蘋果》後，市占率將達46%！全世界都看得出來這就是媒體壟斷，只有公平會看不出來！', '2012-11-29', '2012-11-29', '09:00:00', '00:00:00', '公平交易委員會大樓', 0, '2013-04-23 12:53:02', 0, 0, 0, '反媒體巨獸青年聯盟', 'http://www.idontwantwantleague.blogspot.tw/'),
(192, 101, '309全台廢核大遊行', 2, 'Taipei', '停止追加核四預算\n停止核四裝填燃料\n停止危險核電，核一二三儘速除役\n核廢立即遷出蘭嶼，全面檢討核廢政策\n政府落實「用電需求零成長」政策', '2013-03-09', '2013-03-10', '14:00:00', '00:00:00', '凱達格蘭大道', 0, '2013-04-23 12:54:58', 0, 0, 0, '台灣綠色公民行動聯盟', 'http://www.gcaa.org.tw/'),
(193, 101, '309中台灣廢核大遊行', 2, 'Taichung', '停止追加核四預算\n停止核四裝填燃料\n停止危險核電，核一二三儘速除役\n核廢立即遷出蘭嶼，全面檢討核廢政策\n政府落實「用電需求零成長」政策', '2013-03-09', '2013-03-09', '13:00:00', '00:00:00', '市民廣場', 0, '2013-04-23 12:56:32', 0, 0, 0, '中台灣廢核行動聯盟', 'https://www.facebook.com/nonukestaichung'),
(194, 101, '309南灣廢核大遊行', 2, 'Kaohsiung', '停建核四\n核一、二、三提前除役\n落實用電零成長政策', '2013-03-09', '2013-03-09', '13:00:00', '00:00:00', '凹仔底公園', 0, '2013-04-23 12:57:58', 0, 0, 0, '南臺灣廢核行動聯盟', 'https://www.facebook.com/2013STNoNuke'),
(195, 101, '309東台灣廢核大遊行', 2, 'Taitung', '核廢立刻遷出蘭嶼\n拒絕核廢料進入台東，台東縣政府應承擔起保護台東的責任\n全面檢討核廢料處置政策，拒絕不公不義選址方式及荒謬不合理公投\n核四停工，終結核電，沒有核電，沒有核廢。', '2013-03-09', '2013-03-09', '13:00:00', '00:00:00', '新生公園', 0, '2013-04-23 13:00:38', 0, 0, 0, '台東廢核反核廢行動聯盟', 'http://aljungic430.blogspot.tw/'),
(196, 101, '326護台灣大遊行', 9, 'taipei', '表達對於中華人民共和國全國人民代表大會通過《反分裂國家法》所構成進一步安全威脅的強烈抗議與不滿。', '2005-03-26', '2005-03-26', '14:00:00', '00:00:00', '凱達格蘭大道', 0, '2013-04-23 13:06:01', 0, 0, 0, '民主和平護台灣大聯盟', 'http://taiwanpeace.blogspot.tw/'),
(197, 101, '為食物安全而走，燭光靜默大遊行', 1, 'taipei', '401愚人節，抗議政府愚民政策。抗議政府開放瘦肉精美牛，三管五卡破功、開放美牛黑箱作業，陳冲瀆職拒下台。公佈有條件開放帶瘦肉精美牛「全民公敵之黑心立委」', '2012-04-01', '2012-04-01', '17:00:00', '00:00:00', '自由廣場', 0, '2013-04-23 13:08:00', 0, 0, 0, '全國食物安全聯盟', 'https://www.facebook.com/events/208585469247897/'),
(198, 101, '守護消防大遊行', 9, 'Taipei', '一、休息人性化，救災沒在怕\n二、人力要補足，市府快提案\n三、任務有分工，服務更有效\n四、評比要改革，基層要協商', '2013-04-06', '2013-04-06', '13:00:00', '00:00:00', '國父紀念館', 0, '2013-04-23 13:13:11', 0, 0, 0, '搶救消防人員', 'https://www.facebook.com/savefirefighter'),
(199, 101, '政府沒良心、基層累到爆！', 9, 'Taipei', '1.廢除責任制：刪除勞基法84條之1。\n2.違法雇主，課以刑責。\n3.反對勞動彈性化：刪除勞基法第30條及30條之1變形工時規定。\n4.要求人力補足', '2013-04-25', '2013-04-25', '10:00:00', '00:00:00', '行政院', 0, '2013-04-23 13:14:33', 0, 0, 0, '搶救消防人員', 'https://www.facebook.com/savefirefighter'),
(238, 101, '三二六民主和平護台灣大遊行', 9, 'Taipei', '本次遊行有來自台灣各地的數十萬民眾參與，藉以表達對於中華人民共和國全國人民代表大會通過《反分裂國家法》所構成進一步安全威脅的強烈抗議與不滿。本次遊行是臺灣歷史上少見的超大型動員遊行，並首次有現任總統參與。', '2005-03-26', '2005-03-26', '14:00:00', '00:00:00', '凱達格蘭大道', NULL, '2013-05-12 09:14:19', 0, 0, 0, 'https://zh.wikipedia.org/wiki/%E4%B8%89%E4%BA%8C%E5%85%AD%E8%AD%B7%E5%8F%B0%E7%81%A3%E5%A4%A7%E9%81%8A%E8%A1%8C', '民主和平護台灣大聯盟'),
(241, 101, '勞團五一上街頭', 6, 'Taipei', '五一勞動節兩萬五千名勞工上街，要求行政院懸崖勒馬，不能通過「繳多、領少、延後領」的假改革方案。關廠工人連線則計畫提前在四月二十八日發起無限期絕食行動，要求政府儘速解決關廠工人的欠款爭議。', '2013-04-26', '2013-04-26', '00:00:00', '00:00:00', '凱達格蘭大道', NULL, '2013-05-12 09:42:09', 0, 0, 0, '勞工團體', ''),
(245, 101, '608護魚大會師', 10, 'Taipei', '台灣近海違法漁撈作業嚴重，進近海漁業資源日益枯竭，6月8日世界海洋日，全台漁民將上凱道遊行，要求政府拿出魄力，解決海洋無魚問題。\n此活動由台灣海域保護及監測協會、台灣西海岸保育聯盟、彰化縣環境保護聯盟、蠻野心足生態協會、台灣環境資訊協會、各區漁會、桃園在地聯盟、台灣海龍王愛地球協會等團體發起。\n活動提出五大訴求：政府應該積極查緝違法漁撈及毒電炸魚的害群之馬、嚴懲3海浬內違法拖網漁船、設立海洋部及海洋保育警察署、近海海域設立完整保育帶、漁業署主動規劃各種經濟性魚種的休漁期、限補期及漁民補貼。', '2013-06-08', '2013-06-08', '14:00:00', '00:00:00', '凱達格蘭大道', 0, '2013-06-01 15:32:14', 3, 0, 0, '台灣海域保護及監測協會…等', 'http://www.coolloud.org.tw/node/74442'),
(244, 101, '廢核星火 將會燎原', 2, 'Taipei', '反核這一把從 90 年代開始的星火，從核電廠與核廢料周邊居民的身上，一路交到 21 世紀的新生代手中，讓我們一起來傳遞星火，宣誓下一階段廢核力量更大的集結。\n滴水終能穿石、星火將會燎原、廢核就是現在！', '2013-05-26', '2013-05-26', '14:00:00', '20:30:00', '立法院濟南路', 0, '2013-05-29 02:40:26', 4, 0, 0, '主婦聯盟環境保護基金會', 'http://www.huf.org.tw/event/content/1778'),
(277, 101, '2013江汀村生命與和平大遊行', 10, '濟州市', ' 揭露海軍以及政府在國防的虛假原因下，強制執行建設的背叛行為，以及Woo Keun-Min 濟州自治道政府縱容這一切，並與其站在同一陣線。另外，也是為了聚集民憤。(*濟州道知事的選舉將在2014年舉行，目前Woo Keun-Min 知事的民調相當低。)\n\n讓大眾討論關於：濟州島在濟州島海軍基地計畫下被軍事化的可能行，以及東北亞軍事衝突發生的可能性。讓大眾意識到持續進行反對濟州島海軍基地計畫之抗爭的必要性。\n\n無法親自參與但想要聲援的國際人士，您可以在7月20日之前，將您的聲援信息(一百字內)、聲援照片，或者聲援影片，電郵到此信箱：Gangjeongintl@gmail.com\n\n詳細請點活動網址', '2013-07-28', '2013-07-28', '19:00:00', '19:00:00', '江汀村禮堂 ', 0, '2013-07-01 02:35:25', 0, 0, 0, '江汀村村民停止海軍基地建設計畫委員會...等', 'http://savejejunow.org/%E8%99%9F%E5%8F%AC%E5%8A%A0%E5%85%A52013%E5%B9%B4%E6%B1%9F%E6%B1%80%E6%9D%91%E7%94%9F%E5%91%BD%E8%88%87%E5%92%8C%E5%B9%B3%E5%A4%A7%E9%81%8A%E8%A1%8C%EF%BC%9A7%E6%9C%8829%E6%97%A58%E6%9C%883%E6%97%A5/'),
(264, 101, '社群網站設計期末成果展', 5, 'Tainan', '網路已經成為下一世代主流的互動平台, 每個組織甚至每個人都在學習透過網路與世界接軌, 熟悉相關的技術可以協助學生掌握趨勢, 為未來做好準備. 本進階課程致力於提升網站的專業性, 互動性, 多樣性. 專業的團隊需要各方面的人才, 本課程與工設系以及企管系合作, 同學在這裡可以體驗跨領域的活動, 過程會非常有趣. 期末是以一個專業的社群網站為目標, 會是一門具挑戰性的課程, 但成果絕對值得. ', '2013-06-26', '2013-06-26', '15:00:00', '15:00:00', '成功大學 電機系 B1 令洋廳', 0, '2013-06-07 12:53:59', 100, 0, 0, '張天豪老師', 'http://zoro.ee.ncku.edu.tw/swd/'),
(276, 101, '2013高雄同志公民運動', 7, 'Kaohsiung', '此次活動設計了輕鬆有趣的「六彩魔幻屋」讓民眾能貼近同志文化，\n對多元性別有多一分了解，晚上更有精彩的「青春論壇」，\n由中廣流行網主持人雷夢娜領銜，廣邀專家學者及政府官員，\n歡迎民眾於當晚前往同歡，一起「人來瘋」熱情開講。', '2013-07-14', '2013-07-14', '17:30:00', '17:30:00', '瑞豐夜市', 0, '2013-07-01 02:28:00', 1, 0, 0, '台灣愛之希望協會、陽光酷兒中心', 'http://www.sunshinequeer.tw/ne_cont.asp?id=1535&ida=12&idf1=2013619183736'),
(281, 101, '大家相約來去國防部!給仲丘討公道!', 10, 'Taipei', '今天的國防部記者會相信都讓各位朋友相當''''滿意''''\n國防部的官員大概以為這樣就從此又可以過得''''愜意''''\n正義的鄉民有可能就這樣放他們算了嗎???\n滿肚子的怨氣要從何處抒發???\n為了怕大家氣到內傷導致中暑又橫紋肌溶解\n我們這邊舉辦了一場消暑活動\n參加完保證清涼又退火', '2013-07-20', '2013-07-20', '09:00:00', '09:00:00', '國防部', 0, '2013-07-16 00:31:45', 1, 0, 0, '公民1985行動聯盟', 'http://www.ptt.cc/bbs/Militarylife/M.1373893644.A.CFD.html'),
(286, 101, '', 0, '', '', '0000-00-00', '0000-00-00', '00:00:00', NULL, '', 0, '2013-07-23 16:17:20', 0, 0, 0, '', ''),
(287, 133, '', 2, '', '', '0000-00-00', '0000-00-00', '00:00:00', '00:00:00', '', 0, '2014-02-06 05:29:26', 0, 0, 0, '', 'http://'),
(288, 133, '全台廢核大遊行：忍無可忍，不見不散', 2, 'Taiwan', '反核運動這一年累積的憤怒，將在今年再度爆發，民間的反核力量再次集結，要向政府開戰，廢核大遊行已開始籌備與宣傳，定在3月8日(週六)擴大舉辦，北中南東四地再度同步上街，訴求全面廢核、面對核廢、終結核四、立即停建! 向政府表達我們已忍無可忍！', '2014-03-08', '2014-03-08', '00:00:00', '00:00:00', '全台各地', 0, '2014-02-06 05:32:49', 0, 0, 0, '全國廢核行動平台', 'https://www.facebook.com/events/517191981735139/?ref_dashboard_filter=calendar&source=1'),
(305, 133, '服貿協議粗暴闖關 群賢樓前守護民主之夜', 5, 'Taipei', '立法院內政委員會下午將兩岸服務貿易協議排入聯席會審查，國民黨籍召委張慶忠趁亂宣布開會，並對外宣稱已經將服貿送出委員會。對此民間團體表示強烈譴責，並決議號召全民包圍立法院要求服貿協議應循民主程序逐條審查，3/18日上午十點三十分於立法院召開記者會公布包圍行動。', '2014-03-18', '2014-03-18', '18:00:00', '18:00:00', '台北市中正區中山南路1號 , 立法院', 0, '2014-03-25 06:24:03', 0, 0, 0, '台灣守護民主平台、反黑箱服貿協議主辦', 'https://www.facebook.com/events/1432128060361397/?source=1'),
(302, 132, 'test', 2, '', '', '0000-00-00', '0000-00-00', '00:00:00', '00:00:00', '', 0, '2014-02-27 07:17:34', 0, 0, 0, '', 'http://'),
(306, 101, '還我國會 白色正義 站出來', 10, 'Taipei', '今天我們的「國會」遭受占領，我們要以和平、理性的方式去表達我們的訴求。\n我們要站上街頭，表達社會另一種聲音，我們尊重他們的言論自由，但不能無視「國會空轉」。\n請大家一起站出來 勇敢的說「還我國會、尊重法治、支持民主、守護台灣、全台人民站起來! 」', '2014-03-29', '2014-03-29', '17:00:00', '19:00:00', '台北車站南二門前廣場集合', NULL, '2014-03-28 05:53:15', NULL, NULL, NULL, 'https://www.facebook.com/taiwan.wish2014?fref=ts', '白色正義社會聯盟'),
(307, 101, ' 捍衛民主 退回服貿 3/30人民站出來!', 5, 'Taipei', '邀請所有台灣的人民，為國家的未來、臺灣的民主一起站出來。讓我們身穿黑衣，站上凱道，進行一場和平、非暴力的行動！共同支持占領立院行動，直到馬政府正面回應人民的訴求為止。讓馬政府知道公民堅定的意志，展現捍衛台灣民主的決心。這不僅是一場學生運動，也是一場公民運動，更是一場捍衛民主的神聖戰役！\n\n我們譴責國家暴力，並再次重申這次運動四個訴求：\n一、退回服貿協議；\n二、兩岸協議監督法制化，先立法、再審查服貿協議；\n三、召開公民憲政會議；\n四、要求朝野立委站出來，響應人民的訴求。', '2014-03-30', '2014-03-30', '13:00:00', '19:00:00', '凱達格蘭大道', 0, '2014-03-28 05:56:59', NULL, NULL, NULL, '台灣守護民主平台、反黑箱服貿協議主辦', 'https://www.facebook.com/events/1471107093105919/?source=1');

-- --------------------------------------------------------

--
-- 表的结构 `movement_comment`
--

CREATE TABLE IF NOT EXISTS `movement_comment` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `topicID` int(11) NOT NULL,
  `user` varchar(255) NOT NULL,
  `comment` text NOT NULL,
  `like` int(11) NOT NULL,
  `dislike` int(11) NOT NULL,
  `upTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=122 ;

--
-- 转存表中的数据 `movement_comment`
--

INSERT INTO `movement_comment` (`id`, `topicID`, `user`, `comment`, `like`, `dislike`, `upTime`) VALUES
(107, 245, '105', '什麼時候能夠在辦呢', 0, 0, '2013-06-24 16:32:54'),
(106, 245, '105', '參加不到了!!', 0, 0, '2013-06-24 12:50:18'),
(105, 245, '105', '一定要參加!!', 0, 0, '2013-06-23 08:32:21'),
(104, 264, '134', 'GOGOGO!!!', 2, 0, '2013-06-19 14:06:09'),
(103, 264, '101', '超酷的大家快去看看~~', 1, 0, '2013-06-17 16:05:11'),
(102, 244, '105', '確實應該廢核一下...', 0, 0, '2013-06-08 09:53:57'),
(101, 264, '105', '太酷了!!!!', 1, 0, '2013-06-08 09:53:30'),
(100, 264, '132', '太好惹XDD\n', 2, 0, '2013-06-07 14:47:21'),
(98, 245, '133', '時間快到了！\n有興趣的人快去支援～', 0, 0, '2013-06-06 12:35:47'),
(99, 264, '133', '成功了！！', 1, 0, '2013-06-07 13:31:50'),
(108, 264, '105', '快喔大家快來玩', 1, 0, '2013-06-24 16:39:48'),
(109, 264, '105', '果然很棒阿', 1, 0, '2013-06-24 17:01:37'),
(110, 264, '105', '請問之後還有要辦嗎?', 1, 0, '2013-06-25 14:47:37'),
(111, 241, '97', 'test1\n', 0, 0, '2013-06-26 07:41:30'),
(112, 264, '107', '這邊沒有顯示留言時間是嗎?', 1, 0, '2013-06-27 03:35:32'),
(113, 264, '107', '留言好像不能刪, 點了 join 好像也不能取消?', 1, 0, '2013-06-27 03:36:20'),
(114, 276, '133', '同性議題正夯啊！', 0, 0, '2013-07-03 04:22:09'),
(115, 264, '121', '網路已經成為下一世代主流的互動平台, 每個組織甚至每個人都在學習透過網路與世界接軌, 熟悉相關的技術可以協助學生掌握趨勢, 為未來做好準備. 本進階課程致力於提升網站的專業性, 互動性, 多樣性. 專業的團隊需要各方面的人才, 本課程與工設系以及企管系合作, 同學在這裡可以體驗跨領域的活動, 過程會非常有趣. 期末是以一個專業的社群網站為目標, 會是一門具挑戰性的課程, 但成果絕對值得. ', 2, 0, '2013-07-05 18:25:21'),
(116, 277, '97', '大家要多多支持為和平的活動喔！大家要多多支持為和平的活動喔！大家要多多支持為和平的活動喔！大家要多多支持為和平的活動喔！', 2, 0, '2013-07-08 17:41:15'),
(117, 277, '133', 'World Peace!!', 0, 0, '2013-07-10 09:39:01'),
(118, 264, '178', '這好像不算是群眾運動，如果這個網站已經上線了的話，這個活動的存在真的有點怪耶', 0, 0, '2013-07-25 17:03:04'),
(119, 277, '184', '加油!!!', 0, 0, '2013-09-02 14:37:10'),
(120, 264, '190', 'test test', 0, 0, '2014-01-16 06:14:53'),
(121, 307, '133', '50萬人上街頭啊！！', 0, 0, '2014-04-04 04:34:20');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
